module.exports.config = {
  name: "ريد",
  version: "1.0.0",
  hasPermssion: 2,
  credits: "Saint",
  description: "يرسل رسالة كل 3 دقائق",
  commandCategory: "tools",
  usages: "ريد",
  cooldowns: 0
};

if (!global.redIntervals) global.redIntervals = {};

const MESSAGE_TEXT = `𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒𝑵𝑲ۥِْ؍ۥِْ؍ُ☠🇭🇰🩸𝑴𝑲 𒈞‌‌𖠚𐎥𝑲𝑺☄🇭🇰🩸𝑴𝑲𒈒
𝒁𝑲𖠚𒈒𝑴𝑲🇭🇰🩸𝑲𝑺𖠚ۥِْ؍ۥ𒈒𝑴𝑲🇭🇰🩸𝑵𝑲☠𒈒

‌⌯ ⟅˖ִ𝗜 𝗔𝗠 ࿂͜•𝙈𝙖𝙨𝙩𝙚𝙧 ། 𝘿𝙚̲̅𝙖̲̅𝙩̲̅𝙝ᬼ 
𝘵͟𝘩𝘦 𝘨͟r͟𝘦𝘢͟𝘵͟𝘦𝘴𝘵 𝘸𝘳𝘪͟𝘭͟͟𝘪͟͟𝘵͟𝘦𝘳 ͟o͟𝘧 𝘵𝘩𝘦 ͟𝘦͟𝘷𝘪𝘭 ͟𝘮͟𝘢͟𝘴͟𝘵𝘦𝘳'𝘴 𝘯͟e͟𝘸𝘴͟𝘱͟𝘢𝘱𝘦𝘳 

 ‌           ⏤͟͟͞͞🔴                        

     𝗥𝗲𝘁𝘂𝗿𝗻 𝗼𝗳 𝘁𝗵𝗲 𝗗𝗲𝗮𝗱      
 ‌ ‌   ─⃝͎̽𝙎𖤌˖𝘼ɵ⃪𝆭͜͡X͎𝆭̽ʌ𝆭⃟ɴ𝙄☃️𝆺𝅥⃝𝙈✬      

 ➣  𝆺𝅥⃝𝗗𝗘𝗩𝗜𝗟 ۬༐ 𝗦҈𝗮𝗶𝗻𝘁🩸𒁂`;

module.exports.run = async function({ api, event, args }) {
  const threadID = event.threadID;

  if (args[0] === "ايقاف") {
    if (global.redIntervals[threadID]) {
      clearInterval(global.redIntervals[threadID]);
      delete global.redIntervals[threadID];
    }
    return;
  }

  if (global.redIntervals[threadID]) return;

  api.sendMessage(MESSAGE_TEXT, threadID);

  global.redIntervals[threadID] = setInterval(() => {
    api.sendMessage(MESSAGE_TEXT, threadID);
  }, 3 * 60 * 1000);
};
